#+title: Dev Notes

* Auth0 Resource Owner
1. Create Native App
   - Enable Password Grant in advance settings
2. Settings -> API Authorization Settings -> Default Directory -> =Username-Password-Authentication=

* Client Auth Method
- LinkedIn, post body only
- StackExchange, post body only
- facebook, post body only

* Linear

#+begin_src sh :results raw
curl https://api.linear.app/graphql \
  -X POST \
  -H "Content-Type: application/json" \
  -H 'Authorization: Bearer lin_oauth' \
  --data '{ "query": "{ viewer { id name email } }" }' \
#+end_src

#+RESULTS:
{"data":{"viewer":{"id":"5860978b-2b66-41ad-81c9-01f7c1fb919d","name":"Hai W.","email":"freizl.em@gmail.com"}}}

* Inbox
** TODO Surface up users :demo_app:
- ~AuthorizationGrantUserStore (MVar (Map.Map IdpName IdpAuthorizationCodeAppSessionData)~
- User AppName would be better since it's already unique.
- Just need to figure out how to match differ UI section
** TODO Refresh button shall only appear when there is refresh token :demo_app:
** TODO Add more fields for OpenIDConfiguration or find an existing impl?
** TODO Rename ~HasTokenRequestClientAuthenticationMethod~
- to ~HasClientAuthenticationMethod~
** TODO applyBearerAuth
